app/controllers/nested_example/trips_controller.rb

INSERT INTO "trips" ("name", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "My Trip"], ["start_date", Sun, 14 Feb 2016], ["end_date", Sun, 21 Feb 2016], ["created_at", 2016-02-09 01:02:12 UTC], ["updated_at", 2016-02-09 01:02:12 UTC]]
---
  def create
    binding.pry
    @trip = Trip.new(transformed_trip_params)

    if @trip.save